# DBDocHasConn

## Description
Checks if the current document has connections to an ODBC data source.

```pascal
FUNCTION DBDocHasConn : BOOLEAN;
```

```python

def vs.DBDocHasConn():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2011
## Category
* ODBC